sdaiGetComplexEntityBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**)
\details
Complex instance will be created within parent schema if such combination doesn't exist.
\param schemaName   [in] name of the schema.
\param nameNumber   [in] count of names.
\param nameVector   [in] names array of members of complex entities.
\returns a valid SdaiEntity if succeeded, otherwise returns nullptr.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NVLD - Entity definition invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiString nameCollection[] = { "odanamedunit", "odasiunit" };
SdaiEntity complexEntity = sdaiGetComplexEntityBN("odatest", 2, nameCollection);